#include <stdio.h>
//存浮点数9.0
//1001.0
//(-1)^0*1.001*2^3
//(-1)^s * M  *2^E
//
//0.5
//二进制为0.1
//(-1)^0* 1.0 *2^-1
//E要加上一个中间值再存储，若是float类型要加上127，double类型加上1023

//指数E从内存中取出分三种情况：
//1.E不为全0不为全1：则-127（-1023）得到真实值，
//2.E为全0：-127（-1023）得到真实值，M不再加上第一位的1，而是直接为0.xxx的小数
//3.E全为1：若M为0，则是无穷大的数字


int main()
{
	int n =9;
	// 0 00000000 0000000000000000001001-补码
	//
	float *pFloat =(float *)&n;
	printf("n的值为：%d\n",n);
	printf("*pFloat的值为：%f\n",*pFloat);
     //（-1)^0 *0.000000000000000000001001 *2^-126
	*pFloat = 9.0;
	//1001.0
	//1.001 * 2^3
	//(-1)^0 * 1.001 * 2^3
	//0 10000010 00100000000000000000000正数原反补相同
	printf("num的值为：%d\n",n);//1091567616
	printf("*pFloat的值为：%f\n",*pFloat);//9.0
	return 0;

}